const axios = require("axios");
const moment = require("moment");
const qs = require("qs");
const { v4 } = require("uuid");

const encodedAuthData = process.env.GIGACHAT_AUTH_DATA;

// Функция для получения токена доступа
const getAccessToken = async () => {
  try {
    const uuid = v4();
    const stringBody = qs.stringify({ scope: "GIGACHAT_API_PERS" });
    const response = await axios.post(
      "https://ngw.devices.sberbank.ru:9443/api/v2/oauth",
      stringBody, // или другой scope в зависимости от вашего типа доступа
      {
        headers: {
          "Content-Type": "application/x-www-form-urlencoded",
          Accept: "*/*",
          RqUID: uuid,
          Authorization: `Basic ${encodedAuthData}`,
        },
      }
    );

    return response.data;
  } catch (error) {
    console.error("Ошибка при получении токена доступа:", error);
    throw error;
  }
};

let token = { access_token: "", expires_at: null };

// Функция для отправки сообщения и получения ответа от GigaChat

const sendMessageToGigachat = async (message) => {
  // Массив нежелательных тем
  const bannedTopics = [
    "цветы",
    "цветок",
    "цветами",
    "цветах",
    "рецепты",
    "рецепт",
    "рецептом",
    "рецептах",
    "кино",
    "кинотеатр",
    "кинотеатры",
    "киносеансы",
    "фильмы",
    "фильм",
    "фильме",
    "фильмах",
    "сериалы",
    "сериал",
    "сериале",
    "сериалах",
    "музыка",
    "музыки",
    "музыкальный",
    "музыкальные",
    "концерты",
    "концерт",
    "концерта",
    "концерте",
    "игры",
    "игра",
    "игре",
    "играх",
    "спорт",
    "спорта",
    "спортивный",
    "спортивные",
    "мода",
    "моды",
    "моде",
    "модный",
    "одежда",
    "одежды",
    "одежде",
    "одежду",
    "путешествия",
    "путешествие",
    "путешествии",
    "путешествий",
    "отдых",
    "отдыхе",
    "отдыха",
    "отдыху",
    "туризм",
    "туризма",
    "туризме",
    "туристический",
    "здоровье",
    "здоровья",
    "здоровьем",
    "здоровом",
    "диета",
    "диеты",
    "диете",
    "диет",
    "косметика",
    "косметики",
    "косметикой",
    "косметический",
    "красота",
    "красоты",
    "красоте",
    "красивый",
    "животные",
    "животного",
    "животным",
    "животных",
    "питомцы",
    "питомец",
    "питомца",
    "питомцев",
    "обучение",
    "обучения",
    "обучении",
    "обучением",
    "учеба",
    "учёба",
    "учебе",
    "учебы",
    "литература",
    "литературе",
    "литературой",
    "литературный",
    "книги",
    "книга",
    "книге",
    "книгой",
    "искусство",
    "искусства",
    "искусстве",
    "искусством",
    "гаджеты",
    "гаджет",
    "гаджета",
    "гаджетов",
    "технологии",
    "технология",
    "технологиях",
    "технологический",
    "социальные сети",
    "социальной сети",
    "социальные сети",
    "социальных сетей",
    "знакомства",
    "знакомство",
    "знакомстве",
    "знакомств",
    "еда",
    "еды",
    "еде",
    "едой",
    "напитки",
    "напиток",
    "напитке",
    "напитках",
    "праздники",
    "праздник",
    "празднике",
    "праздниках",
    "автомобили",
    "автомобиль",
    "автомобиле",
    "автомобилях",
    "транспорт",
    "транспорта",
    "транспорте",
    "транспортный",
    "готовить",
    "готовлю",
    "готовила",
    "готовило",
    "готовят",
    "плавать",
    "плаваю",
    "плавал",
    "плавала",
    "плавают",
    "рисовать",
    "рисую",
    "рисовал",
    "рисовала",
    "рисуют",
    "петь",
    "пою",
    "пел",
    "пела",
    "поют",
    "танцевать",
    "танцую",
    "танцевал",
    "танцевала",
    "танцуют",
    "летать",
    "летаю",
    "летал",
    "летала",
    "летают",
    "читать",
    "читаю",
    "читал",
    "читала",
    "читают",
    "путешествовать",
    "путешествую",
    "путешествовал",
    "путешествовала",
    "путешествуют",
    "купаться",
    "купаюсь",
    "купался",
    "купалась",
    "купаются",
    "лепить",
    "леплю",
    "лепил",
    "лепила",
    "лепят",
    "праздновать",
    "праздную",
    "праздновал",
    "праздновала",
    "празднуют",
    "вязать",
    "вяжу",
    "вязал",
    "вязала",
    "вяжут",
    "шить",
    "шью",
    "шил",
    "шила",
    "шьют",
    "играть",
    "играю",
    "играл",
    "играла",
    "играют",
    "заниматься",
    "занимаюсь",
    "занимался",
    "занималась",
    "занимаются",
    "учиться",
    "учусь",
    "учился",
    "училась",
    "учатся",
    "плавить",
    "плавлю",
    "плавил",
    "плавила",
    "плавят",
    "жарить",
    "жарю",
    "жарил",
    "жарила",
    "жарят",
  ];

  // Проверяем, содержит ли сообщение одну из нежелательных тем
  const triggeredTopic = bannedTopics.find((topic) =>
    message.toLowerCase().includes(topic)
  );

  if (triggeredTopic) {
    return `Простите, я ничего не знаю про ${triggeredTopic}, спросите меня лучше об электричестве.`;
  }

  try {
    if (token.access_token === "" || token.expires_at < moment().valueOf()) {
      token = await getAccessToken();
    }
    const response = await axios.post(
      "https://gigachat.devices.sberbank.ru/api/v1/chat/completions",
      {
        model: "GigaChat",
        messages: [{ role: "user", content: message }],
      },
      {
        headers: {
          "Content-Type": "application/json",
          Accept: "application/json",
          Authorization: `Bearer ${token.access_token}`,
        },
      }
    );

    const botResponse = response.data.choices[0].message.content;
    return botResponse;
  } catch (error) {
    console.error("Ошибка при отправке сообщения в GigaChat:", error);
    throw error;
  }
};

// const sendMessageToGigachat = async (message) => {
//   // Массив нежелательных тем
//   const bannedTopics = [
//     "цветы",
//     "цветок",
//     "цветами",
//     "цветах",
//     "рецепты",
//     "рецепт",
//     "рецептом",
//     "рецептах",
//     "кино",
//     "кинотеатр",
//     "кинотеатры",
//     "киносеансы",
//     "фильмы",
//     "фильм",
//     "фильме",
//     "фильмах",
//     "сериалы",
//     "сериал",
//     "сериале",
//     "сериалах",
//     "музыка",
//     "музыки",
//     "музыкальный",
//     "музыкальные",
//     "концерты",
//     "концерт",
//     "концерта",
//     "концерте",
//     "игры",
//     "игра",
//     "игре",
//     "играх",
//     "спорт",
//     "спорта",
//     "спортивный",
//     "спортивные",
//     "мода",
//     "моды",
//     "моде",
//     "модный",
//     "одежда",
//     "одежды",
//     "одежде",
//     "одежду",
//     "путешествия",
//     "путешествие",
//     "путешествии",
//     "путешествий",
//     "отдых",
//     "отдыхе",
//     "отдыха",
//     "отдыху",
//     "туризм",
//     "туризма",
//     "туризме",
//     "туристический",
//     "здоровье",
//     "здоровья",
//     "здоровьем",
//     "здоровом",
//     "диета",
//     "диеты",
//     "диете",
//     "диет",
//     "косметика",
//     "косметики",
//     "косметикой",
//     "косметический",
//     "красота",
//     "красоты",
//     "красоте",
//     "красивый",
//     "животные",
//     "животного",
//     "животным",
//     "животных",
//     "питомцы",
//     "питомец",
//     "питомца",
//     "питомцев",
//     "обучение",
//     "обучения",
//     "обучении",
//     "обучением",
//     "учеба",
//     "учёба",
//     "учебе",
//     "учебы",
//     "литература",
//     "литературе",
//     "литературой",
//     "литературный",
//     "книги",
//     "книга",
//     "книге",
//     "книгой",
//     "искусство",
//     "искусства",
//     "искусстве",
//     "искусством",
//     "гаджеты",
//     "гаджет",
//     "гаджета",
//     "гаджетов",
//     "технологии",
//     "технология",
//     "технологиях",
//     "технологический",
//     "социальные сети",
//     "социальной сети",
//     "социальные сети",
//     "социальных сетей",
//     "знакомства",
//     "знакомство",
//     "знакомстве",
//     "знакомств",
//     "еда",
//     "еды",
//     "еде",
//     "едой",
//     "напитки",
//     "напиток",
//     "напитке",
//     "напитках",
//     "праздники",
//     "праздник",
//     "празднике",
//     "праздниках",
//     "автомобили",
//     "автомобиль",
//     "автомобиле",
//     "автомобилях",
//     "транспорт",
//     "транспорта",
//     "транспорте",
//     "транспортный",
//     "готовить",
//     "готовлю",
//     "готовила",
//     "готовило",
//     "готовят",
//     "плавать",
//     "плаваю",
//     "плавал",
//     "плавала",
//     "плавают",
//     "рисовать",
//     "рисую",
//     "рисовал",
//     "рисовала",
//     "рисуют",
//     "петь",
//     "пою",
//     "пел",
//     "пела",
//     "поют",
//     "танцевать",
//     "танцую",
//     "танцевал",
//     "танцевала",
//     "танцуют",
//     "летать",
//     "летаю",
//     "летал",
//     "летала",
//     "летают",
//     "читать",
//     "читаю",
//     "читал",
//     "читала",
//     "читают",
//     "путешествовать",
//     "путешествую",
//     "путешествовал",
//     "путешествовала",
//     "путешествуют",
//     "купаться",
//     "купаюсь",
//     "купался",
//     "купалась",
//     "купаются",
//     "лепить",
//     "леплю",
//     "лепил",
//     "лепила",
//     "лепят",
//     "праздновать",
//     "праздную",
//     "праздновал",
//     "праздновала",
//     "празднуют",
//     "вязать",
//     "вяжу",
//     "вязал",
//     "вязала",
//     "вяжут",
//     "шить",
//     "шью",
//     "шил",
//     "шила",
//     "шьют",
//     "играть",
//     "играю",
//     "играл",
//     "играла",
//     "играют",
//     "заниматься",
//     "занимаюсь",
//     "занимался",
//     "занималась",
//     "занимаются",
//     "учиться",
//     "учусь",
//     "учился",
//     "училась",
//     "учатся",
//     "плавить",
//     "плавлю",
//     "плавил",
//     "плавила",
//     "плавят",
//     "жарить",
//     "жарю",
//     "жарил",
//     "жарила",
//     "жарят",
//   ];

//   // Проверяем, содержит ли сообщение одну из нежелательных тем
//   const containsBannedTopic = bannedTopics.some((topic) =>
//     message.toLowerCase().includes(topic)
//   );

//   if (containsBannedTopic) {
//     return "Спросите меня лучше об электричестве";
//   }

//   try {
//     if (token.access_token === "" || token.expires_at < moment().valueOf()) {
//       token = await getAccessToken();
//     }
//     const response = await axios.post(
//       "https://gigachat.devices.sberbank.ru/api/v1/chat/completions",
//       {
//         model: "GigaChat",
//         messages: [{ role: "user", content: message }],
//       },
//       {
//         headers: {
//           "Content-Type": "application/json",
//           Accept: "application/json",
//           Authorization: `Bearer ${token.access_token}`,
//         },
//       }
//     );

//     const botResponse = response.data.choices[0].message.content;
//     return botResponse;
//   } catch (error) {
//     console.error("Ошибка при отправке сообщения в GigaChat:", error);
//     throw error;
//   }
// };

module.exports = sendMessageToGigachat;

// const axios = require("axios");
// const moment = require("moment");
// const qs = require("qs");
// const { v4 } = require("uuid");

// const encodedAuthData = process.env.GIGACHAT_AUTH_DATA;

// // Функция для получения токена доступа
// const getAccessToken = async () => {
//   try {
//     const uuid = v4()
//     const stringBody = qs.stringify({ scope: "GIGACHAT_API_PERS" })
//     console.log("прошла генерация getAccessToken.")
//     const response = await axios.post(
//       "https://ngw.devices.sberbank.ru:9443/api/v2/oauth",
//       stringBody, // или другой scope в зависимости от вашего типа доступа
//       {
//         headers: {
//           "Content-Type": "application/x-www-form-urlencoded",
//           Accept: "*/*",
//           RqUID: uuid,
//           Authorization: `Basic ${encodedAuthData}`,
//         },
//       }
//     );

//     return response.data;
//   } catch (error) {
//     console.error("Ошибка при получении токена доступа:", error);
//     throw error;
//   }
// };

// let token = { access_token: '', expires_at: null }
// // Функция для отправки сообщения и получения ответа от GigaChat
// const sendMessageToGigachat = async (message) => {

//   try {
//     if (token.access_token === '' || token.expires_at < moment().valueOf()) {

//       token = await getAccessToken();
//     }
//     const response = await axios.post(
//       "https://gigachat.devices.sberbank.ru/api/v1/chat/completions",
//       {
//         model: "GigaChat",
//         messages: [{ role: "user", content: message }],
//       },
//       {
//         headers: {
//           "Content-Type": "application/json",
//           Accept: "application/json",
//           Authorization: `Bearer ${token.access_token}`,
//         },
//       }
//     );

//     const botResponse = response.data.choices[0].message.content;
//     return botResponse;
//   } catch (error) {
//     console.error("Ошибка при отправке сообщения в GigaChat:", error);
//     throw error;
//   }
// };

// module.exports = sendMessageToGigachat
